//============================================================
//
//	グリッドマネージャーヘッダー [gridManager.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _GRID_MANAGER_H_
#define _GRID_MANAGER_H_

//************************************************************
//	定数宣言
//************************************************************
namespace grid
{
	const int WIDTH	 = 10;	// グリッド横幅
	const int HEIGHT = 20;	// グリッド縦幅
}

//************************************************************
//	前方宣言
//************************************************************
class CObject3D;	// オブジェクト3Dクラス

//************************************************************
//	クラス定義
//************************************************************
// グリッドマネージャークラス
class CGridManager
{
public:
	// コンストラクタ
	CGridManager();

	// デストラクタ
	~CGridManager();

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(const float fDeltaTime);	// 更新

	// 静的メンバ関数
	static CGridManager *Create(void);	// 生成
	static void Release(CGridManager *&prGridManager);	// 破棄

private:
	// メンバ変数
	CObject3D *m_apGrid[grid::WIDTH][grid::HEIGHT];	// グリッド情報
};

#endif	// _GRID_MANAGER_H_
